#include "Game.h"

/// <summary>
/// ゲームループ
/// </summary>
void Game::GameLoop()
{

	// =======================================
	//  初期化処理
	// =======================================


	// ------------------------------
	//  ゲームループ
	// ------------------------------
	while (ProcessMessage() == 0)
	{
		// リフレッシュレートを設定するための処理
		clock_t check_fps = clock() + CLOCKS_PER_SEC / 60;

		// マウスカーソル表示設定
		SetMouseDispFlag(FALSE);

		// 画面上の描画を初期化（画面を消去）
		ClearDrawScreen();

		// =======================================
		//  入力処理
		// =======================================


		// =======================================
		//  更新処理
		// =======================================


		// =======================================
		//  画面描画処理
		// =======================================	




		// =======================================
		//  音声再生処理
		// =======================================


		// リフレッシュレートが一定になるまで待つ処理
		while (clock() < check_fps) {}

		// 裏画面の描画を表に反映
		ScreenFlip();

		// ESCキーでループから抜ける
		if (CheckHitKey(KEY_INPUT_ESCAPE)) {
			break;
		}

	}
}